app/controllers/applications_controller.rb

    def update
     if @application.update(application_params)
---
UPDATE `applications` SET `applications`.`name` = 'New Application Name', `applications`.`updated_at` = '2024-03-24 22:43:15.304989' WHERE `applications`.`id` = 2

    def create
      @application = Application.new(application_params)
      if @application.save
---
INSERT INTO `applications` (`name`, `token`, `chats_count`, `created_at`, `updated_at`) VALUES ('New Application Name', '32af0b4f374daca34b32e8901bcc48fb', NULL, '2024-03-25 04:48:34.684001', '2024-03-25 04:48:34.684001')

  def set_application
    @application = Application.find_by(token: params[:id])
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '21a28e6a35929e571fb40ed4694aeec4' LIMIT 1