app/controllers/chats_controller.rb

DELETE FROM `chats` WHERE `chats`.`id` = 35
---
  def destroy
    @chat.destroy

SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = '8e250894363d856274c10d65bb5f766e' LIMIT 1
---
   def set_application
    @application = Application.find_by(token: params[:application_id])

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 4 AND `chats`.`chat_number` IS NULL LIMIT 1
---
  def set_chat
    return unless @application # Ensure @application is set before proceeding
    @chat = @application.chats.find_by(chat_number: params[:id])