app/controllers/messages_controller.rb

def create

  message = CreateMessageWorker.new.perform(@chat.chat_number,message_params,@application.id)
    if message.present?
      render json: message, status: :created
    else
      render json: { error: 'Failed to create chat' }, status: :unprocessable_entity
    end

=begin
  last_message_number = @chat.messages.maximum(:message_number).to_i  || 0
  number = last_message_number + 1

  @message = @chat.messages.build(message_params.merge(message_number: number))


  if @message.save
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 4 AND `chats`.`chat_number` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 5 ORDER BY CAST(message_number AS INTEGER) DESC LIMIT 1
SELECT MAX(`messages`.`message_number`) FROM `messages` WHERE `messages`.`chat_id` = 40
INSERT INTO `messages` (`body`, `chat_id`, `message_number`, `created_at`, `updated_at`) VALUES ('New Application Name', 40, '1', '2024-03-26 05:24:55.690155', '2024-03-26 05:24:55.690155')

def update
  if @message.update(message_params)
---
UPDATE `messages` SET `messages`.`body` = 'best Application Name', `messages`.`updated_at` = '2024-03-27 03:20:37.005686' WHERE `messages`.`id` = 85

    def set_application_and_chat
      @application = Application.find_by(token: params[:application_id])
      @chat = @application.chats.find_by(chat_number: params[:chat_id])
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`token` = 'c6ee0096acd66bb733fe67722f058414' LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2 AND `chats`.`chat_number` = 1 LIMIT 1

    def set_message
      @message = @chat.messages.find_by(message_number: params[:id])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 2 AND `messages`.`message_number` = '1' LIMIT 1