app/models/chat.rb

UPDATE `applications` SET `applications`.`chats_count` = COALESCE(`applications`.`chats_count`, 0) + 1 WHERE `applications`.`id` = 1
---
    def increment_application_chats_count
      self.messages_count = 0
      application.increment!(:chats_count)