app/models/message.rb

UPDATE `chats` SET `chats`.`messages_count` = COALESCE(`chats`.`messages_count`, 0) + 1 WHERE `chats`.`id` = 1
---
  def update_chat_messages_count
    chat.increment!(:messages_count)