app/jobs/create_chat_worker.rb

  def perform(application_id)
    application = Application.find(application_id)

    redis = Redis.new(url: 'redis://redis:6379')

    lock_key = "lock:application:#{application_id}"
    lock_expire_time = 10 # Set lock expiry time in seconds
    lock_acquired = redis.set(lock_key, "LOCKED", nx: true, ex: lock_expire_time)

    if lock_acquired
      begin
        Rails.logger.info "Chat creation job started"

        # Process the chat creation logic (e.g., create chat in database)
        last_chat = application.chats.order(chat_number: :desc).first
        number = last_chat ? last_chat.chat_number + 1 : 1
        chat = application.chats.create!(chat_number: number)
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 3 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 3 ORDER BY `chats`.`chat_number` DESC LIMIT 1
INSERT INTO `chats` (`application_id`, `messages_count`, `chat_number`, `created_at`, `updated_at`) VALUES (3, NULL, 1, '2024-03-27 01:19:44.706248', '2024-03-27 01:19:44.706248')

  def perform(application_id)
    application = Application.find(application_id)
    chat = application.chats.create(chat_number: next_chat_number(application))
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = NULL LIMIT 1
INSERT INTO `chats` (`application_id`, `messages_count`, `chat_number`, `created_at`, `updated_at`) VALUES (2, NULL, 1, '2024-03-27 00:43:45.716152', '2024-03-27 00:43:45.716152')

  def next_chat_number(application)
    last_chat = application.chats.order(chat_number: :desc).first
---
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 2 ORDER BY `chats`.`chat_number` DESC LIMIT 1