app/jobs/create_message_worker.rb

  def perform(chat_id, body,application_id)

    application = Application.find( application_id)
    chat = application.chats.find_by(chat_number: chat_id)

    redis = Redis.new(url: 'redis://redis:6379')

    # Acquire a lock for the message
    lock_key = "lock:chat:#{chat_id}"
    lock_expire_time = 10 # Set lock expiry time in seconds
    lock_acquired = redis.set(lock_key, "LOCKED", nx: true, ex: lock_expire_time)

    if lock_acquired
      begin
        # Process the message creation logic (e.g., create message in database)
        last_chat = chat.messages.order(message_number: :desc).first
        number = last_chat ? last_chat.message_number+ 1 : 1
        message = chat.messages.create!(body.merge(message_number: number))
---
SELECT `applications`.* FROM `applications` WHERE `applications`.`id` = 5 LIMIT 1
SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 5 AND `chats`.`chat_number` = 2 LIMIT 1
SELECT MAX(`messages`.`message_number`) FROM `messages` WHERE `messages`.`chat_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 24 ORDER BY `messages`.`message_number` DESC LIMIT 1
INSERT INTO `messages` (`body`, `chat_id`, `message_number`, `created_at`, `updated_at`) VALUES ('New Application Name', 24, 1, '2024-03-27 03:17:25.528830', '2024-03-27 03:17:25.528830')